# Core development tools
brew "git"
brew "node"
brew "yarn"
brew "pnpm"

# Python development
brew "python@3.13"
brew "pip"

# Docker for containerization
brew "docker"
brew "docker-compose"

# Database tools
brew "postgresql@15"
brew "mongodb-community"
brew "redis"

# Utilities for development
brew "tree"
brew "wget"
brew "curl"
brew "jq"
brew "gh"
brew "httpie"

# Version control helpers
brew "git-lfs"

# Build tools
brew "cmake"
brew "pkg-config"

# Applications
cask "docker"
cask "postman"
cask "tableplus"
cask "google-chrome"
cask "firefox"

# Optional but useful utilities
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "bat"

# MongoDB tap
tap "mongodb/brew"
